// Підключаємо файл оголошення класу Point
#include "classes.h"

// Конструктор класу Point, що ініціалізує координати x та y
Point::Point(double _x, double _y) {
    x = _x;// Зберігаємо передане значення _x у змінну x
    y = _y;// Зберігаємо передане значення _y у змінну y
}

// Метод класу Point, що повертає значення координати x об'єкта
double Point::getX() {
    return x;// Повертаємо значення координати x
}

// Метод класу Point, що повертає значення координати y об'єкта
double Point::getY() {
    return y;// Повертаємо значення координати y
}